// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");

// Юнит-тесты проверяют методы или классы в изоляции от других частей системы

// Интеграционные тесты проверяют работу системы в целом, а не отдельных ее компонентов
// Могут включать в себя несколько модулей или целые подсистемы,
// их целью является проверка взаимодействия между ними и общей работоспособности системы
// Помогают обнаруживать ошибки, которые могут возникнуть только при работе системы в целом,
// а не при работе отдельных ее компонентов
