public class Program
{
    //!
    /*
        gRPC
        SOAP
        Mapster
        Асинхронность
        Многопоточность
        Паттерн SAGA для распределенных транзакций
		Фильтры в ASP.NET Core 
		При работе с бд использовать пул соединений, чтобы не создавать каждый раз новое соединение
		Таймауты к внешним сервисам
		Индексация таблиц
		Реплицирование бд
		.net 10
        Grafana
        Prometheus
        Elastic log
        Serilog logging
		Докер-сеть
        Unit of Work
        Идемпотентность
        MSSQL (UI в DataGrip)
        PostgreSQL(JSONb, blob, EntityFramework)
        CI/CD (build, test, test, deploy)
        Балансировщик нагрузки
		Harbor - хранилище докер образов
		S3
		Nginx (Nginx Proxy Manager)
		Portainer
		Kubernetes/Kubernetes OKD
		Redis (UI в DataGrip)
		Оркестратор, библиотека MassTransit
		Docker (настроить prod-версию vault)
		Docker (загрузка проекта в Docker Hub)
		Apache benchmark для нагрузочного тестирования
		Локально развернуть minikube dashboard - позволяет работать с k8s через ui
		Монетизация: подписка или баннерная реклама
		Локализация на популярные языки
		GitLab можно развернуть у себя на сервере и никто не увидит код
		Алерты с ошибками в тг
		Запустить проект в докер контейнере
		Паттерн пул соединений - не открывать каждый раз соединение, когда поступает запрос, а один раз

		Фримен, Э. Робсон - Head First. Паттерны проектирования
		Ларман - Применение UML и шаблонов проектирования
		Рихтер - CLR via C#
		Скит - C# in Depth
		Албахари - C# 12 in a Nutshell
		Клеппман - Высоконагруженные приложения
		Смит - Entity Framework Core in Action
		Лок - ASP.NET Core in Action
		Рой - RabbitMQ in Depth
		Kafka: The Definitive Guide
		Ричардсон - Микросервисы. Паттерны разработки и рефакторинга

		Nginx
		- скрывает внутренние порты
		- балансирует нагрузку
		- аналог api gateway?
		- защита от ddos

		В кубер есть одна мастер нода (или 3 для отказоустойчивости), в которой ничего не хранится,
		она только управляет другими
		И есть несколько воркер нод, где крутятся сервисы

		В мастер ноде есть
		- бд etcd (ключ-значение)
		- шедулер
		- ари сервер, с которым все общаются
		- контроллер менеджер - следит, чтобы все было сделано, что мы попросили кубер сделать
    */

    static void Main()
    {
    }
}
